Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC00/svd/PIC32CK2051GC00100.svd
            <register>
               <name>MEIDR</name>
               <description>Master Error Interrupt Disable</description>
               <addressOffset>0x154</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MERR0</name>
                     <description>Master 0 Access Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR1</name>
                     <description>Master 1 Access Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR2</name>
                     <description>Master 2 Access Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR3</name>
                     <description>Master 3 Access Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR4</name>
                     <description>Master 4 Access Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR5</name>
                     <description>Master 5 Access Error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR6</name>
                     <description>Master 6 Access Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR7</name>
                     <description>Master 7 Access Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR8</name>
                     <description>Master 8 Access Error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR9</name>
                     <description>Master 9 Access Error</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR10</name>
                     <description>Master 10 Access Error</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR11</name>
                     <description>Master 11 Access Error</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR12</name>
                     <description>Master 12 Access Error</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR13</name>
                     <description>Master 13 Access Error</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR14</name>
                     <description>Master 14 Access Error</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR15</name>
                     <description>Master 15 Access Error</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MEIMR</name>
               <description>Master Error Interrupt Mask</description>
               <addressOffset>0x158</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MERR0</name>
                     <description>Master 0 Access Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR1</name>
                     <description>Master 1 Access Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR2</name>
                     <description>Master 2 Access Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR3</name>
                     <description>Master 3 Access Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR4</name>
                     <description>Master 4 Access Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR5</name>
                     <description>Master 5 Access Error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR6</name>
                     <description>Master 6 Access Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR7</name>
                     <description>Master 7 Access Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR8</name>
                     <description>Master 8 Access Error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR9</name>
                     <description>Master 9 Access Error</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR10</name>
                     <description>Master 10 Access Error</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR11</name>
                     <description>Master 11 Access Error</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR12</name>
                     <description>Master 12 Access Error</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR13</name>
                     <description>Master 13 Access Error</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR14</name>
                     <description>Master 14 Access Error</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR15</name>
                     <description>Master 15 Access Error</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MESR</name>
               <description>Master Error Status</description>
               <addressOffset>0x15C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MERR0</name>
                     <description>Master 0 Access Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR1</name>
                     <description>Master 1 Access Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR2</name>
                     <description>Master 2 Access Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR3</name>
                     <description>Master 3 Access Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR4</name>
                     <description>Master 4 Access Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR5</name>
                     <description>Master 5 Access Error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR6</name>
                     <description>Master 6 Access Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR7</name>
                     <description>Master 7 Access Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR8</name>
                     <description>Master 8 Access Error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR9</name>
                     <description>Master 9 Access Error</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR10</name>
                     <description>Master 10 Access Error</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR11</name>
                     <description>Master 11 Access Error</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR12</name>
                     <description>Master 12 Access Error</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR13</name>
                     <description>Master 13 Access Error</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR14</name>
                     <description>Master 14 Access Error</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR15</name>
                     <description>Master 15 Access Error</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>MEAR[%s]</name>
               <description>Master Error Address</description>
               <addressOffset>0x160</addressOffset>
               <size>32</size>
               <access>read-only</access>
            </register>
