Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC00/svd/PIC32CK2051GC00100.svd
            <register>
               <name>LSR</name>
               <description>ITM Software Lock Status Register</description>
               <addressOffset>0xFB4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SLI</name>
                     <description>Software Lock implemented</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLK</name>
                     <description>Software Lock status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>nTT</name>
                     <description>Not thirty-two bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEVARCH</name>
               <description>ITM Device Architecture Register</description>
               <addressOffset>0xFBC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x47701A01</resetValue>
               <fields>
                  <field>
                     <name>ARCHPART</name>
                     <description>Architecture Part</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>ARCHVER</name>
                     <description>Architecture Version</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REVISION</name>
                     <description>Revision</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRESENT</name>
                     <description>DEVARCH Present</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARCHITECT</name>
                     <description>Architect</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEVTYPE</name>
               <description>ITM Device Type Register</description>
               <addressOffset>0xFCC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MAJOR</name>
                     <description>Major type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SUB</name>
                     <description>Sub-type</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIDR4</name>
               <description>ITM Peripheral Identification Register 4</description>
               <addressOffset>0xFD0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DES_2</name>
                     <description>JEP106 continuation code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>4KB count</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIDR5</name>
               <description>ITM Peripheral Identification Register 5</description>
               <addressOffset>0xFD4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PIDR6</name>
               <description>ITM Peripheral Identification Register 6</description>
               <addressOffset>0xFD8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PIDR7</name>
               <description>ITM Peripheral Identification Register 7</description>
               <addressOffset>0xFDC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PIDR0</name>
               <description>ITM Peripheral Identification Register 0</description>
               <addressOffset>0xFE0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PART_0</name>
                     <description>Part number bits[7:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIDR1</name>
               <description>ITM Peripheral Identification Register 1</description>
               <addressOffset>0xFE4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PART_1</name>
                     <description>Part number bits[11:8]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DES_0</name>
                     <description>JEP106 identification code bits [3:0]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIDR2</name>
               <description>ITM Peripheral Identification Register 2</description>
               <addressOffset>0xFE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DES_1</name>
                     <description>JEP106 identification code bits[6:4]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>JEDEC</name>
                     <description>JEDEC assignee value is used</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REVISION</name>
                     <description>Component revision</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIDR3</name>
               <description>ITM Peripheral Identification Register 3</description>
               <addressOffset>0xFEC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CMOD</name>
                     <description>Customer Modified</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REVAND</name>
                     <description>RevAnd</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CIDR0</name>
               <description>ITM Component Identification Register 0</description>
               <addressOffset>0xFF0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0000000D</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_0</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CIDR1</name>
               <description>ITM Component Identification Register 1</description>
               <addressOffset>0xFF4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000090</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_1</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CLASS</name>
                     <description>CoreSight component class</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CIDR2</name>
               <description>ITM Component Identification Register 2</description>
               <addressOffset>0xFF8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000005</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_2</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CIDR3</name>
               <description>ITM Component Identification Register 3</description>
               <addressOffset>0xFFC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x000000B1</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_3</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
